{"class_name": "Sequential", "config": [{"class_name": "GRU", "config": {"stateful": false, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "dropout": 0.2, "unroll": false, "batch_input_shape": [null, 39, 32], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_state": false, "dtype": "float32", "bias_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "units": 128, "recurrent_dropout": 0.2, "trainable": true, "bias_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "tanh", "name": "gru_1"}}, {"class_name": "GRU", "config": {"stateful": false, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "dropout": 0.2, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_state": false, "bias_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "units": 128, "recurrent_dropout": 0.2, "trainable": true, "bias_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "tanh", "name": "gru_2"}}, {"class_name": "GRU", "config": {"stateful": false, "implementation": 0, "go_backwards": false, "recurrent_regularizer": null, "dropout": 0.2, "unroll": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_state": false, "bias_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "units": 128, "recurrent_dropout": 0.2, "trainable": true, "bias_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "tanh", "name": "gru_3"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "units": 512, "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "relu", "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "units": 1, "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "sigmoid", "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}], "keras_version": "2.0.8", "backend": "tensorflow"}