{"keras_version": "2.0.8", "class_name": "Sequential", "config": [{"class_name": "GRU", "config": {"batch_input_shape": [null, 39, 32], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.2, "units": 128, "recurrent_regularizer": null, "bias_constraint": null, "activation": "tanh", "return_state": false, "stateful": false, "unroll": false, "implementation": 0, "kernel_constraint": null, "recurrent_dropout": 0.2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "gru_1", "return_sequences": true, "use_bias": true, "recurrent_constraint": null, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "go_backwards": false}}, {"class_name": "GRU", "config": {"recurrent_dropout": 0.2, "unroll": false, "units": 128, "use_bias": true, "recurrent_regularizer": null, "activation": "tanh", "return_state": false, "stateful": false, "dropout": 0.2, "implementation": 0, "kernel_constraint": null, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "gru_2", "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "recurrent_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "go_backwards": false}}, {"class_name": "GRU", "config": {"recurrent_dropout": 0.2, "unroll": false, "units": 128, "use_bias": true, "recurrent_regularizer": null, "activation": "tanh", "return_state": false, "stateful": false, "dropout": 0.2, "implementation": 0, "kernel_constraint": null, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "gru_3", "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "recurrent_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "go_backwards": false}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "dense_1", "use_bias": true, "units": 512, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "name": "dense_2", "use_bias": true, "units": 1, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}], "backend": "tensorflow"}