{"config": {"output_layers": [["add_1", 0, 0]], "name": "model_1", "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_2", "batch_input_shape": [null, 1]}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_2"}, {"config": {"sparse": false, "dtype": "float32", "name": "input_3", "batch_input_shape": [null, 1]}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_3"}, {"config": {"input_length": 1, "dtype": "float32", "embeddings_regularizer": null, "trainable": true, "output_dim": 64, "embeddings_constraint": null, "input_dim": 6041, "batch_input_shape": [null, 1], "activity_regularizer": null, "name": "embedding_1", "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "mask_zero": false}, "class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding_1"}, {"config": {"input_length": 1, "dtype": "float32", "embeddings_regularizer": null, "trainable": true, "output_dim": 64, "embeddings_constraint": null, "input_dim": 3953, "batch_input_shape": [null, 1], "activity_regularizer": null, "name": "embedding_2", "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "mask_zero": false}, "class_name": "Embedding", "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "embedding_2"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "flatten_1"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "name": "flatten_2"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dropout_1"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "dropout_2"}, {"config": {"input_length": 1, "dtype": "float32", "embeddings_regularizer": null, "trainable": true, "output_dim": 1, "embeddings_constraint": null, "input_dim": 6041, "batch_input_shape": [null, 1], "activity_regularizer": null, "name": "embedding_3", "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "mask_zero": false}, "class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding_3"}, {"config": {"input_length": 1, "dtype": "float32", "embeddings_regularizer": null, "trainable": true, "output_dim": 1, "embeddings_constraint": null, "input_dim": 3953, "batch_input_shape": [null, 1], "activity_regularizer": null, "name": "embedding_4", "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "mask_zero": false}, "class_name": "Embedding", "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "embedding_4"}, {"config": {"axes": 1, "normalize": false, "name": "dot_1", "trainable": true}, "class_name": "Dot", "inbound_nodes": [[["dropout_1", 0, 0, {}], ["dropout_2", 0, 0, {}]]], "name": "dot_1"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["embedding_3", 0, 0, {}]]], "name": "flatten_3"}, {"config": {"name": "flatten_4", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["embedding_4", 0, 0, {}]]], "name": "flatten_4"}, {"config": {"name": "add_1", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["dot_1", 0, 0, {}], ["flatten_3", 0, 0, {}], ["flatten_4", 0, 0, {}]]], "name": "add_1"}]}, "class_name": "Model", "keras_version": "2.0.8", "backend": "tensorflow"}