{"keras_version": "2.0.8", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1], "name": "input_1"}, "name": "input_1"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1], "name": "input_2"}, "name": "input_2"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Embedding", "config": {"output_dim": 32, "activity_regularizer": null, "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "input_length": 1, "dtype": "float32", "batch_input_shape": [null, 1], "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "name": "embedding_1", "embeddings_constraint": null, "input_dim": 6041}, "name": "embedding_1"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Embedding", "config": {"output_dim": 32, "activity_regularizer": null, "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "input_length": 1, "dtype": "float32", "batch_input_shape": [null, 1], "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "trainable": true, "name": "embedding_2", "embeddings_constraint": null, "input_dim": 3953}, "name": "embedding_2"}, {"inbound_nodes": [[["embedding_1", 0, 0, {}]]], "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"inbound_nodes": [[["embedding_2", 0, 0, {}]]], "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "name": "flatten_2"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.3}, "name": "dropout_1"}, {"inbound_nodes": [[["flatten_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.3}, "name": "dropout_2"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 4], "name": "input_3"}, "name": "input_3"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}], ["input_3", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "name": "concatenate_1"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 36, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "name": "dense_1"}, "name": "dense_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}], ["dropout_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_2"}, "name": "concatenate_2"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}], ["dense_1", 0, 0, {}]]], "class_name": "Dot", "config": {"trainable": true, "name": "dot_1", "normalize": false, "axes": 1}, "name": "dot_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}], ["dropout_2", 0, 0, {}]]], "class_name": "Dot", "config": {"trainable": true, "name": "dot_2", "normalize": false, "axes": 1}, "name": "dot_2"}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}], ["dot_1", 0, 0, {}], ["dot_2", 0, 0, {}], ["input_3", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_3"}, "name": "concatenate_3"}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "name": "dense_2"}, "name": "dense_2"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.3}, "name": "dropout_3"}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "name": "dense_3"}, "name": "dense_3"}], "output_layers": [["dense_3", 0, 0]], "name": "model_1"}, "class_name": "Model"}